---
kind: method
id: M:Autodesk.Revit.Exceptions.CentralModelAccessDeniedException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/2aa8c0c9-f0e8-f3b0-cc17-03154782aef1.htm
---
# Autodesk.Revit.Exceptions.CentralModelAccessDeniedException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.